In [1]:
from pandas import DataFrame, Series
import pandas as pd
import numpy as np

In [2]:
obj = Series(range(3), index = ['a','b','c'])
index = obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [3]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [11]:
index = pd.Index(range(3))
index

RangeIndex(start=0, stop=3, step=1)

In [7]:
index = pd.Index(np.arange(3))
index

Int64Index([0, 1, 2], dtype='int64')

In [12]:
obj2 = Series([1.5, -2.5, 0], index = index)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [14]:
obj2.index is index

True

In [16]:
pop = {'Nevada': {2001:2.4, 2002:2.9},
      'Ohio': {2000:1.5, 2001:1.7, 2002:3.6}}
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [19]:
'Ohio' in frame3.columns

True

 <br>

In [21]:
obj = Series([4.5, 7.2, -5.3, 3.6], index = ['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [23]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [24]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [25]:
obj3 = Series(['blue', 'purple', 'yellow'], index = range(0,5,2))
obj3

0      blue
2    purple
4    yellow
dtype: object

In [29]:
obj3.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [32]:
frame = DataFrame(np.arange(9).reshape(3,3),
                  index = ['a', 'c', 'd'],
                  columns = ['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [33]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [34]:
frame3 = frame.reindex(columns = ['Texas', 'Oregon', 'Ohio'])
frame3

   Texas  Oregon  Ohio
a      1     NaN     0
c      4     NaN     3
d      7     NaN     6

In [35]:
obj = Series(range(5), index = ['a', 'b', 'c', 'd', 'e'])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [36]:
obj.drop('c')

a    0
b    1
d    3
e    4
dtype: int32

In [50]:
data = DataFrame(np.arange(16).reshape(4,4).T,
                index = ['a', 'b', 'c', 'd'],
                columns = ['t1', 't2', 't3', 't4'])
data

   t1  t2  t3  t4
a   0   4   8  12
b   1   5   9  13
c   2   6  10  14
d   3   7  11  15

In [44]:
data.drop('a').drop(3, axis =1)
### drop명령어에서 axis = 1을 붙여야 columns 값 삭제

   0  1   2
b  1  5   9
c  2  6  10
d  3  7  11

 <br>

In [52]:
data[['t1','t4']]

   t1  t4
a   0  12
b   1  13
c   2  14
d   3  15

In [57]:
data[data['t1']>1]

   t1  t2  t3  t4
c   2   6  10  14
d   3   7  11  15

In [59]:
data.loc[['a','b'],['t1', 't3']]

   t1  t3
a   0   8
b   1   9

In [62]:
df1 = DataFrame(np.arange(9).reshape(3,3),
               columns = list('bcd'),
               index = ['OR', 'CA', 'TX'])
df2 = DataFrame(np.arange(9).reshape(3,3),
               columns = list('adf'),
               index = ['OR', 'CA', 'WA'])

In [63]:
df1

    b  c  d
OR  0  1  2
CA  3  4  5
TX  6  7  8

In [64]:
df2

    a  d  f
OR  0  1  2
CA  3  4  5
WA  6  7  8

In [65]:
df1 + df2

     a   b   c    d   f
CA NaN NaN NaN  9.0 NaN
OR NaN NaN NaN  3.0 NaN
TX NaN NaN NaN  NaN NaN
WA NaN NaN NaN  NaN NaN

In [69]:
df1.add(df2, fill_value=0)

      a    b    c    d    f
CA  3.0  3.0  4.0  9.0  5.0
OR  0.0  0.0  1.0  3.0  2.0
TX  NaN  6.0  7.0  8.0  NaN
WA  6.0  NaN  NaN  7.0  8.0

In [71]:
df1.reindex(df2.index, fill_value = 0)

    b  c  d
OR  0  1  2
CA  3  4  5
WA  0  0  0

 <br>

In [72]:
arr = DataFrame(np.arange(1,13).reshape(3,4))
arr

   0   1   2   3
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [83]:
arr-arr.loc[0]

   0  1  2  3
0  0  0  0  0
1  4  4  4  4
2  8  8  8  8

In [90]:
f = lambda x: x.max() - x.min()

In [91]:
f(arr)

0    8
1    8
2    8
3    8
dtype: int32

In [93]:
arr.apply(f, axis =1)

0    3
1    3
2    3
dtype: int64

#### 정렬

In [94]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [96]:
frame.sort_index(axis=1)

   California  Ohio  Texas
a           2     0      1
c           5     3      4
d           8     6      7

In [98]:
frame.sort_index(ascending = False)

   Ohio  Texas  California
d     6      7           8
c     3      4           5
a     0      1           2

In [102]:
frame['Ohio'].sort_values()

a    0
c    3
d    6
Name: Ohio, dtype: int32

In [106]:
frame[frame%2==0]=2
frame

   Ohio  Texas  California
a     2      1           2
c     3      2           5
d     2      7           2

In [108]:
frame.sort_values(by='Ohio', ascending = False)

   Ohio  Texas  California
c     3      2           5
a     2      1           2
d     2      7           2